app/views/links/index.html.erb

SELECT "clicks".* FROM "clicks" WHERE "clicks"."link_id" = $1  [["link_id", 1]]
---
        <td><%= @ip_address %></td>
        <td><%= Click.where(link_id: link.id).map(&:count).inject(:+)%></td>