app/views/links/index.json.jbuilder

SELECT "clicks".* FROM "clicks" WHERE "clicks"."link_id" = $1  [["link_id", 1]]
---
  json.shortened_url link.shortened_url
  json.count Click.where(link_id: link.id).map(&:count).inject(:+)

SELECT COUNT(*) FROM "users" INNER JOIN "clicks" ON "users"."id" = "clicks"."user_id" WHERE "clicks"."link_id" = $1  [["link_id", 1]]
---
	    json.last_visited user.last_sign_in_at
  		json.user_clicks Click.find_by(link_id: link.id, user_id: user.id).count