app/views/links/show.html.erb

SELECT "clicks".* FROM "clicks" WHERE "clicks"."link_id" = $1  [["link_id", 3]]
---
  <strong>Clicks:</strong>
  <%= Click.where(link_id: @link.id).map(&:count).inject(:+) %>