app/views/links/show.json.jbuilder

json.shortened_url @link.shortened_url
json.count Click.where(link_id: @link.id).map(&:count).inject(:+)
---
SELECT "clicks".* FROM "clicks" WHERE "clicks"."link_id" = $1  [["link_id", 2]]