app/controllers/links_controller.rb

SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @link = Link.find_by(id: params[:id])

SELECT  "links".* FROM "links" WHERE "links"."shortened_url" = $1 LIMIT 1  [["shortened_url", "hbhNWB"]]
SELECT  "clicks".* FROM "clicks" WHERE "clicks"."link_id" = 5 AND "clicks"."user_id" = $1  ORDER BY "clicks"."id" DESC LIMIT 1  [["user_id", 1]]
SELECT COUNT(*) FROM "clicks" WHERE "clicks"."link_id" = 5 AND "clicks"."user_id" = $1  [["user_id", 1]]
UPDATE "clicks" SET "count" = $1, "updated_at" = $2 WHERE "clicks"."id" = $3  [["count", 1], ["updated_at", "2017-04-06 05:58:33.541518"], ["id", 2]]
INSERT INTO "clicks" ("link_id", "user_id", "count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["link_id", 1], ["user_id", 3], ["count", 1], ["created_at", "2017-04-06 08:22:46.059042"], ["updated_at", "2017-04-06 08:22:46.059042"]]
---
  def go
    link = Link.find_by(shortened_url: params["short_url"])
    click = Click.where(link: link.id).where(user_id: current_user.id).last
    if click
      click.count += 1
      click.save
    else
      Click.create(link_id: link.id, user_id: current_user.id,count: 1)

INSERT INTO "links" ("given_url", "shortened_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["given_url", "https://dashboard.heroku.com/apps/stg-new-picnic/activity"], ["shortened_url", "eiuZ8r"], ["created_at", "2017-04-06 05:42:56.975268"], ["updated_at", "2017-04-06 05:42:56.975268"]]
---
  def create
    @link = Link.new(link_params)
    unless link_params["given_url"].empty?
      url = @link.shorten(link_params["given_url"])
      @link.given_url = link_params["given_url"]
      @link.shortened_url = url
    end
    respond_to do |format|
      if @link.save

DELETE FROM "links" WHERE "links"."id" = $1  [["id", 1]]
---
  def destroy
    @link.destroy